<style lang="less">
@baseColor: #ffc124;

.agreement_box{
	padding-bottom: 50px;
	.page_title{
		text-align: center;
		font-size: 20px;
		color: #666;
	}

	.nav_box{
		width: 480px;
		margin: 40px auto;
		-webkit-justify-content: space-between;
		justify-content: space-between;


		a{
			display: block;
			font-size: 18px;
			color: #333;
			cursor: pointer;
			padding: 10px 0;

			&.active{
				color: @baseColor;
				border-bottom: 4px solid @baseColor;
			}
		}
	}

	.content_inner{
		width: 600px;
		margin:0 auto;
		padding: 30px 100px;
		border: 1px solid #c8c8c8;
		background-color: #fff;
		color: #999;
		line-height: 2;
	}
}
</style>

<template>
	<ui-header></ui-header>
	<div class="bd_main agreement_box">
		<h2 class="page_title">协议与声明</h2>
		<nav class="nav_box flex-wrap">
			<a v-for="its in nav" 
				v-text="its" 
				:class="{'active': $index===navIndex}" 
				@click.prevent="navIndex=$index"></a>
		</nav>
		<div class="content_inner">
			<div class="item" v-show="navIndex===0">
				<p>阁下在发布信息时不得利用本服务从事违法违规行为，包括但不限于：</p>
				<ol>
					<li>发布、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；</li>
					<li>发布、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</li>
					<li>恶意虚构事实、隐瞒真相以误导、欺骗他人；</li>
					<li>发布、传播广告信息及垃圾信息；</li>
					<li>发送、传播的相关内容不为阁下所有或阁下并未获得权利人的授权；</li>
					<li>其他法律法规禁止的行为。</li>
				</ol>
				<p>阁下理解并同意以下附则</p>
				<ol>
					<li>我们可为遵循本规则或提供本服务的目的而使用阁下发送或传播的内容；</li>
					<li>如果我们收到权利人通知，主张阁下发送或传播的内容侵犯其相关权利的，我们有权独立判断并采取适当技术手段（包括但不
限于删除、屏蔽或断开链接等措施）；</li>
					<li>如果阁下违反了本规则，我们有权独立判断并采取适当技术手段。造成损害的，阁下应予以赔偿，我们对其概不负责，亦不承
担任何法律责任。</li>
				</ol>
			</div>
			<div class="item" v-show="navIndex===1">

				等级    头衔        所需经验  特权
1          1            允许评论、修改信息；每周可发布1条信息
2          5            每周可发布2条信息
3          15          信息热度默认加10 
4          30          每周可发布4条信息
5          50          信息热度默认加20；允许@其他用户
6          100        每天可发布1条信息
7          200        信息热度默认加50
8          500        信息热度默认加70；意见优先处理
9          1000      信息热度默认加100
10        2000      信息热度默认加120；获得勋章《二货大神》
			</div>
			<div class="item" v-show="navIndex===2">
			<p>〇、导言</p>
			<p>在使用本产品前请阁下务必仔细阅读并理解本声明，阁下在开始接受本产品所提供之任何服务时，将被视为对此声明的完全认可。</p>
			<p>一、     账号与安全</p>
			<ol>
				<li>在使用我们所提供的服务时，可能会要求阁下为自己注册一个账号，以便阁下继续使用我们所提供的其他部分功能。</li>
				<li>在阁下注册账号的过程中，需要填写一些必要的信息，请保持这些信息的及时更新，以便我们向阁下更好地提供帮助或服务。若阁下填写的信息不完整或不准确，则可能无法使用服务或在使用过程中受到限制。</li>
				<li>阁下应妥善保管自己的账号与密码。使用完毕后，应安全退出，并采取特定措施保护阁下的号码安全。</li>
				<li>因我们单方面原因导致阁下的账号失窃的，我们将依法承担相应责任。如因阁下保管不善或其他与我们无关的原因导致的，责
任由阁下自行承担。</li>
				<li>作为账号的初始申请注册人和使用人，阁下应对该账号下的所有活动负责。</li>
			</ol>
			<p>二、     个人信息保护</p>
			<ol>
				<li>我们提供服务时，可能会收集、储存和使用：阁下在注册账户或使用我们的服务时，向我们提供的相关个人信息；阁下通过我
们的服务向其他方提供的共享信息等其他与阁下相关的个人信息。</li>
				<li>在阁下使用我们的服务时，我们可能使用阁下的信息向您的设备发送电子邮件、新闻或推送通知。如阁下不希望收到这些信息，
可以按照我们的相关提示，在设备上选择取消订阅。</li>
				<li>我们将尽一切可能采取适当的技术手段，保证阁下可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人
信息。在阁下操作前述信息时，我们可能会采取适当的手段以保障账户安全。</li>
				<li>我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。但请阁下理解，接入我们的服务所用的系
统和通讯网络，有可能因我们可控范围外的因素而出现问题。</li>
			</ol>
			<p>三、     不可抗力</p>
			<ol>
				<li>阁下理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。</li>
				<li>在法律允许的范围内，我们对以下情形导致的服务中断或受阻不承担责任：</li>
				<li>
					<ul>
						<li>1)     受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</li>
						<li>2)     电脑软件、系统、硬件和通信线路出现故障；</li>
						<li>3)     阁下的操作不当；</li>
						<li>4)     阁下通过非我们授权的方式使用本服务；</li>
						<li>5)     其他我们无法控制或合理预见的情形。</li>
					</ul>
				</li>
				<li>阁下理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，我们不对这些因侵权行为给阁下
造成的损害负责。这些风险包括但不限于：</li>
				<li>
					<ul>
						<li>1)     来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；</li>
						<li>2)     因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；</li>
						<li>3)     其他因网络信息或用户行为引起的风险。</li>
					</ul>
				</li>
			</ol>
			<p>四、     知识产权</p>
			<ol>
				<li>我们在本服务中提供的内容的知识产权归本团队所有，用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。</li>
				<li>除另有特别声明外，我们提供本服务时所依托软件的著作权、专利权及其他知识产权均归本团队所有。</li>
				<li>上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经本团队、用户或相关权利人书面许可，任何人不得以任何
形式进行使用或创造相关衍生作品。</li>
				<li>其他相关细则请参见《信息发布规则》。</li>
			</ol>
			<p>五、     变更与中（终）止</p>
			<ol>
				<li>我们可能会对服务内容进行变更，也可能会中断、中止或终止服务。</li>
				<li>如发生下列任何一种情形，我们有权不经通知而中断或终止向阁下提供的服务：</li>
				<li>
					<ul>
						<li>1)     根据规定阁下应提交真实信息，而阁下提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；</li>
						<li>2)     阁下违反相关法规或本协议的约定；</li>
						<li>3)     出于安全的原因或其他必要的情形。</li>
					</ul>
				</li>
				<li>阁下有责任自行备份存储在本服务中的数据。如果阁下的服务被终止，我们可以从服务器上永久地删除数据。服务终止后，我
们没有义务向阁下返还数据。</li>
			</ol>
			</div>
		</div>
	</div>
	<ui-footer></ui-footer>
</template>

<script>
import uiHeader from '../../components/header'
import uiFooter from '../../components/footer'

export default {
	data() {
		return{
			nav: ['信息发布规则', '等级特权', '产品服务与声明'],
			navIndex: 0
		}
	},
	components: {
		uiHeader,
		uiFooter
	}
}
</script>